'''
1.	จงเขียนโปรแกรมคำนวณรายได้จากเงินฝากพร้อมดอกเบี้ยเมื่อเวลาผ่านไป 1 ปี, 2 ปี, 3 ปี, และ 4 ปีที่คำนวณเงินได้แบบดอกเบี้ยทบต้น โดยมีข้อมูลเข้า คือ อัตราดอกเบี้ย และแสดงผลลัพธ์จาก
การคำนวณ โดยพิมพ์ผลลัพธ์แบบชิดขวาที่แสดงเลขทศนิยม 2 ตำแหน่ง เมื่อ
รายได้จากเงินฝาก = เงินต้น(M) x (1-อัตราดอกเบี้ย(R))ปี  = M x (1+R)y 
ให้แสดงรายได้สำหรับเงินต้น 10,000 15,000 20,000 25,000 30,000 35,000 40,000
	ผลลัพธ์
Enter interest rate: 5
'''
rate = int(input("Enter interest rate : ")) / 100

money_list = [10000, 15000, 20000, 25000, 30000, 35000, 40000]

print(f"{'year':10}{'1':^12}{'2':^10}{'3':^12}{'4':^10}")

for money in money_list:
    interest = (1+rate)
    print(f"{money:.2f} | {money * (interest**1):.2f} | {money * (interest**2):.2f} | {money * (interest**3):.2f} | {money * (interest**4):.2f}")