squares = []
for value in range(1,11):
    square = value**2
    squares.append(square)
    print(squares)

### โปรแกรมข้างต้น จะเขียนให้สั้นลงอย่างหรือไม่
squares = [value**2 for value in range(1,11)]
print(squares)

#-------------------------------------------
#* วิธีการนี้เรียกว่า List Comprehension
#* โครงสร้างจะมี 2 ส่วน คือ หน้า for กับหลัง for
#* ส่วนหลัง for จะเป็นคำสั่ง for ตามปกติ
#* ส่วนหน้า for จะเป็นคำสั่งที่ execute ตาม loop ได้คำสั่งเดียวหรือ fn
#* ผลลัพธ์ที่ได้จะอยู่ใน list
#-------------------------------------------

#-------------------------------------------
#* จากตัวอย่างนี้ จะเห็นว่าใน for ยังสามารถใส่เงื่อนไขของ if ได้อีกด้วย
#-------------------------------------------

squares = [value**2 for value in range(1,11) if value%2==1]